Reports/МестаКоманд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>МестаКоманд</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/МестаКоманд/Forms/Форма/Ext/Form/Module.bsl
// http://infostart.ru/public/78455/

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сезон	= Константы.ТекущийСезон.Получить();
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Обновить()
	
КонецПроцедуры

&НаСервере
Процедура Обновить()
	
	Макет = Отчеты.МестаКоманд.ПолучитьМакет("Отчет");
	
	//ЭтаОбработка = РеквизитФормыВЗначение("Объект");	// или этот отчет
	//Макет = ЭтаОбработка.мВернутьМакет();
	
	ТекСезон	= Константы.ТекущийСезон.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Игры.Кто КАК Команда
	|ИЗ
	|	РегистрНакопления.Игры КАК Игры
	|ГДЕ
	|	Игры.Сезон = &Сезон
	|
	|УПОРЯДОЧИТЬ ПО
	|	Игры.Кто.Наименование";
	Запрос.УстановитьПараметр("Сезон", Сезон);
	тзКоманды = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОблШапкаКоманда		= Макет.ПолучитьОбласть("Шапка|Команда");
	ОблШапкаТур			= Макет.ПолучитьОбласть("Шапка|Тур");
	ОблДеталиКоманда	= Макет.ПолучитьОбласть("Детали|Команда");
	ОблДеталиТур		= Макет.ПолучитьОбласть("Детали|Тур");
	
	ПолеТД.Очистить();
	ОбластьЗаголовок.Параметры.НаименованиеОтчета = "Места команд за "+Сезон;
	ПолеТД.Вывести(ОбластьЗаголовок);
	
	КолКоманд = тзКоманды.Количество();
	
	// определить текущие места команд 1 раз при открытии
	// и запомнить места в тз
	тз1 = Новый ТаблицаЗначений;
	запросМаксТур = Новый Запрос;
	запросМаксТур.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ИгрыОбороты.Тур) КАК Тур
	|ИЗ
	|	РегистрНакопления.Игры.Обороты(, , , Сезон = &Сезон) КАК ИгрыОбороты";
	
	запросМаксТур.УстановитьПараметр("Сезон", Сезон);
	Выборка = запросМаксТур.Выполнить().Выбрать();
	
	МаксТур = 0;
	Если Выборка.Следующий() Тогда
		МаксТур = Выборка.Тур
	КонецЕсли;
	
	МестаМаксМин = Новый ТаблицаЗначений;
	тзКоманды.Колонки.Добавить("МестоМин");
	тзКоманды.Колонки.Добавить("МестоМакс");
	тзКоманды.Колонки.Добавить("ТурМин");
	тзКоманды.Колонки.Добавить("ТурМакс");
	
	Для сч = 1 По МаксТур Цикл
		тз1 = обПолучитьТекущиеМестаКоманд(1, 1, сч, Сезон);
		тзКоманды.Колонки.Добавить("т"+сч);	// имя, тип, заголовок, ширина
		// заполнить
		Для текКоманда = 1 По КолКоманд Цикл
			Команда = тзКоманды[текКоманда-1].Команда;
			строка = тз1.Найти(Команда, "Кто");
			стрК = тзКоманды.Найти(Команда, "Команда");
			
			//место = тз1.Индекс(строка) + 1;
			место = строка.Место12;
			стрК["т"+сч] =  место;
			
			Если сч > 4 Тогда	// учесть мин/макс место
				Если стрК.МестоМин = Неопределено Или место < стрК.МестоМин Тогда
					стрК.МестоМин = место;
					стрК.ТурМин = сч;
				КонецЕсли; 
				Если стрК.МестоМакс = Неопределено Или место >= стрК.МестоМакс Тогда
					стрК.МестоМакс = место;
					стрК.ТурМакс = сч;
				КонецЕсли; 
			КонецЕсли;	
			
		КонецЦикла; 
		Если сч = 1 Тогда	
			ПолеТД.Вывести(ОблШапкаКоманда)
		КонецЕсли;	
		ОблШапкаТур.Параметры.НомерТура = сч;
		ПолеТД.Присоединить(ОблШапкаТур)
	КонецЦикла; 
	
	ПолеТД.ФиксацияСверху = ПолеТД.ВысотаТаблицы;
	ПолеТД.НачатьАвтогруппировкуСтрок();
	
	тзКоманды.Сортировать("т"+МаксТур);
	//тп1.Загрузить(тзКоманды);
	
	// ****************************************************************************
	//ЦветФонаОбычный		= Новый Цвет;	//ОблДетали.ЦветФона;
	//ШрифтОбычный		= Новый Шрифт;	//ОблДетали.Шрифт;
	//ШрифтЖирный			= Новый Шрифт(,,Истина);
	
	// области для оформления
	облКоманда		= ОблДеталиКоманда.Область("облКоманда");
	облМесто		= ОблДеталиТур.Область("облМесто");
	
	// определить max/min места команд
	
	
	Для Каждого стрКоманда Из тзКоманды Цикл
		
		ОблКоманда.ЦветТекста = Новый Цвет;
		Если тзКоманды.Индекс(стрКоманда) < 3 Тогда	// призер
			ОблКоманда.ЦветТекста = WebЦвета.КрасноФиолетовый;
		ИначеЕсли тзКоманды.Индекс(стрКоманда) > КолКоманд - 3 Тогда	// вылет
			ОблКоманда.ЦветТекста = WebЦвета.ТемноСерый;
		КонецЕсли;
		ОблДеталиКоманда.Параметры.Команда = стрКоманда.Команда; 
		
		МестоМин = стрКоманда.МестоМин;	МестоМакс = стрКоманда.МестоМакс;
		ТурМин = стрКоманда.ТурМин;	ТурМакс = стрКоманда.ТурМакс;
		
		ПолеТД.Вывести(ОблДеталиКоманда);
		
		БылМин = Ложь;	БылМакс = Ложь;
		
		Для сч = 1 По МаксТур Цикл	// по команде
			Место = стрКоманда["т"+сч];
			ОблДеталиТур.Параметры.Место = Место;
			ОблМесто.ЦветФона = Новый Цвет;
			
			Если Место = МестоМин И сч = ТурМин Тогда
				ОблМесто.ЦветФона = WebЦвета.БледноЗеленый;
				БылМин = Истина
			ИначеЕсли Место = МестоМакс И сч = ТурМакс Тогда
				ОблМесто.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
				БылМакс = Истина
			КонецЕсли;

			ПолеТД.Присоединить(ОблДеталиТур);
		КонецЦикла;
		
	КонецЦикла;
	
	ПолеТД.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеТДОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Команда, Сезон, ДВ", Расшифровка, Сезон, 1);
	ОткрытьФорму("Отчет.ДанныеПоКоманде.Форма.ФормаОтчета", ПараметрыФормы);

КонецПроцедуры
